/*
    Author: Gerardi Vasiliki

    Περιγραφή:

        Αρχείο που περιέχει τον τρόπο υπολογισμού της διακρίνουσας.
        Σε μορφή ιστοσελίδας όπου ο χρήστης μπορεί να εισαγάγει τιμές σε πεδία εισόδου
        και να υπολογίζει τη διακρίνουσα μιας δευτεροβάθμιας εξίσωσης, για να βρεθούν οι ρίζες της εξίσωσης.
*/

// συνάρτηση υπολογισμού διαακρίνουσας 
function Diakrinousa(a,b,g) {
   
    // δηλώνω μία μεταβλητή που θα κρατά τις ρίζες  και τις αρχικοποιώ  σε 0
    let x1=0;
    let x2=0;

    // δηλώνω μία μεταβλητή που θα κρατά την τιμή της διακρίνουσας
    let D = b**2-4*a*g;
    

    // περιπτώσεις διακρίνουσας
    if (D > 0){
       x1=(-b-Math.sqrt(D))/(2*a);
       x2=(-b+Math.sqrt(D))/(2*a);   
    }
    else if (D==0){
        x1=(-b)/(2*a);
        x2=(-b)/(2*a);   
    }
    else{
        x1=(-b-Math.sqrt(Math.abs(D)))/(2*a) + "i";
        x2=(-b+Math.sqrt(Math.abs(D)))/(2*a) +"i";   
        
    }

    // επέστρεψε την τιμή της Διακρίνουσας κααι των ριζών της εξίσωσης
    console.log(D,x1,x2);
    let r= "Η Διακρίνουσα είναι: "+D+ 
          " Η μία ρίζα είναι ίση με: "+x1+
          " Η άλλη ρίζα είναι ίση με: "+x2;   
    return   r
}        
